simulations/lift-drag/mach4/alpha2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

8
(
    inlet
    {
        type            patch;
        nFaces          150;
        startFace       178850;
    }
    outlet
    {
        type            patch;
        nFaces          150;
        startFace       179000;
    }
    airfoil
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          800;
        startFace       179150;
    }
    top_fore
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          500;
        startFace       179950;
    }
    top_wake
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       180450;
    }
    bottom_fore
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          500;
        startFace       180550;
    }
    bottom_wake
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       181050;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          180000;
        startFace       181150;
    }
)

// ************************************************************************* //
